In [1]:
import pandas as pd

In [32]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/004.htm')

In [33]:
df = df[0]

In [34]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Perdue (R) 1,229,724","Taylor (D) 811,049","Hayes (Lib) 81,412"
1,NaN,NaN,NaN,57.9%,38.2%,3.8%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,2698,1330,78
4,ATKINSON,6,6,827,614,35

In [35]:
df = df[3:]

In [36]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  2698  1330   78
4  ATKINSON   6   6   827   614   35
5     BACON   7   7  1216  1097   36
6     BAKER   7   7   391   589   16
7   BALDWIN  16  16  4843  4857  332

In [37]:
df = df.drop(df.columns[[1,2]], axis=1)

In [38]:
df.head(5)

          0     3     4    5
3   APPLING  2698  1330   78
4  ATKINSON   827   614   35
5     BACON  1216  1097   36
6     BAKER   391   589   16
7   BALDWIN  4843  4857  332

In [39]:
df.columns = ['county', 'Sonny Perdue', 'Mark Taylor', 'Garrett Michael Hayes']

In [40]:
df.tail(5)

        county Sonny Perdue Mark Taylor Garrett Michael Hayes
157  WHITFIELD        12563        3924                   382
158     WILCOX         1138         789                    44
159     WILKES         1561        1117                    66
160  WILKINSON         1279        1483                    84
161      WORTH         2986        1926                    98

In [43]:
df = df.melt(id_vars=['county'])

In [44]:
df.to_csv('governor.csv', index=False)